In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1,3,5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.228541  1.181491 -1.570514  1.236818
2013-01-02  1.029785  0.762562 -2.789858 -0.252289
2013-01-03 -0.050886  0.471139  2.065092 -0.500497
2013-01-04 -1.004973  0.224072 -0.728199 -0.415832
2013-01-05 -2.045520  0.284251  0.675340  0.450228
2013-01-06 -0.680768 -1.006230 -0.580834  1.072728

In [7]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -0.228541  1.181491 -1.570514  1.236818
2013-01-02  1.029785  0.762562 -2.789858 -0.252289
2013-01-03 -0.050886  0.471139  2.065092 -0.500497
2013-01-04 -1.004973  0.224072 -0.728199 -0.415832
2013-01-05 -2.045520  0.284251  0.675340  0.450228

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.004973  0.224072 -0.728199 -0.415832
2013-01-05 -2.045520  0.284251  0.675340  0.450228
2013-01-06 -0.680768 -1.006230 -0.580834  1.072728

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[-0.22854121,  1.18149062, -1.57051432,  1.23681794],
       [ 1.02978524,  0.76256174, -2.78985807, -0.25228892],
       [-0.05088585,  0.47113873,  2.06509188, -0.50049677],
       [-1.00497257,  0.22407157, -0.72819867, -0.415832  ],
       [-2.0455202 ,  0.2842511 ,  0.67534006,  0.45022789],
       [-0.68076778, -1.00622951, -0.58083405,  1.07272818]])

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.496817  0.319547 -0.488162  0.265193
std    1.028774  0.738950  1.697548  0.767889
min   -2.045520 -1.006230 -2.789858 -0.500497
25%   -0.923921  0.239116 -1.359935 -0.374946
50%   -0.454654  0.377695 -0.654516  0.098969
75%   -0.095300  0.689706  0.361297  0.917103
max    1.029785  1.181491  2.065092  1.236818

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.228541    1.029785   -0.050886   -1.004973   -2.045520   -0.680768
B    1.181491    0.762562    0.471139    0.224072    0.284251   -1.006230
C   -1.570514   -2.789858    2.065092   -0.728199    0.675340   -0.580834
D    1.236818   -0.252289   -0.500497   -0.415832    0.450228    1.072728

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.236818 -1.570514  1.181491 -0.228541
2013-01-02 -0.252289 -2.789858  0.762562  1.029785
2013-01-03 -0.500497  2.065092  0.471139 -0.050886
2013-01-04 -0.415832 -0.728199  0.224072 -1.004973
2013-01-05  0.450228  0.675340  0.284251 -2.045520
2013-01-06  1.072728 -0.580834 -1.006230 -0.680768

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.680768 -1.006230 -0.580834  1.072728
2013-01-04 -1.004973  0.224072 -0.728199 -0.415832
2013-01-05 -2.045520  0.284251  0.675340  0.450228
2013-01-03 -0.050886  0.471139  2.065092 -0.500497
2013-01-02  1.029785  0.762562 -2.789858 -0.252289
2013-01-01 -0.228541  1.181491 -1.570514  1.236818

In [20]:
df['A']

2013-01-01   -0.228541
2013-01-02    1.029785
2013-01-03   -0.050886
2013-01-04   -1.004973
2013-01-05   -2.045520
2013-01-06   -0.680768
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.228541  1.181491 -1.570514  1.236818
2013-01-02  1.029785  0.762562 -2.789858 -0.252289
2013-01-03 -0.050886  0.471139  2.065092 -0.500497

In [22]:
df.loc[dates[0]]

A   -0.228541
B    1.181491
C   -1.570514
D    1.236818
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.loc[:, ['A','B']]

                   A         B
2013-01-01 -0.228541  1.181491
2013-01-02  1.029785  0.762562
2013-01-03 -0.050886  0.471139
2013-01-04 -1.004973  0.224072
2013-01-05 -2.045520  0.284251
2013-01-06 -0.680768 -1.006230

In [24]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02  1.029785  0.762562
2013-01-03 -0.050886  0.471139
2013-01-04 -1.004973  0.224072

In [26]:
df.at[dates[0], 'A']

-0.22854121143685896

In [27]:
df.iloc[3]

A   -1.004973
B    0.224072
C   -0.728199
D   -0.415832
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.004973  0.224072
2013-01-05 -2.045520  0.284251

In [29]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  1.029785 -2.789858
2013-01-03 -0.050886  2.065092
2013-01-05 -2.045520  0.675340

In [30]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.029785  0.762562 -2.789858 -0.252289
2013-01-03 -0.050886  0.471139  2.065092 -0.500497

In [31]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.181491 -1.570514
2013-01-02  0.762562 -2.789858
2013-01-03  0.471139  2.065092
2013-01-04  0.224072 -0.728199
2013-01-05  0.284251  0.675340
2013-01-06 -1.006230 -0.580834

In [32]:
df.iloc[1,1]

0.7625617434281209

In [33]:
df.iat[1,1]

0.7625617434281209

In [34]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-02  1.029785  0.762562 -2.789858 -0.252289

In [35]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.181491       NaN  1.236818
2013-01-02  1.029785  0.762562       NaN       NaN
2013-01-03       NaN  0.471139  2.065092       NaN
2013-01-04       NaN  0.224072       NaN       NaN
2013-01-05       NaN  0.284251  0.675340  0.450228
2013-01-06       NaN       NaN       NaN  1.072728

In [37]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.228541  1.181491 -1.570514  1.236818    one
2013-01-02  1.029785  0.762562 -2.789858 -0.252289    one
2013-01-03 -0.050886  0.471139  2.065092 -0.500497    two
2013-01-04 -1.004973  0.224072 -0.728199 -0.415832  three
2013-01-05 -2.045520  0.284251  0.675340  0.450228   four
2013-01-06 -0.680768 -1.006230 -0.580834  1.072728  three

In [38]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.050886  0.471139  2.065092 -0.500497   two
2013-01-05 -2.045520  0.284251  0.675340  0.450228  four

In [39]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [40]:
df.at[dates[0], 'A'] = 0

In [41]:
df.iat[0, 1] = 0

In [42]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [43]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -1.570514  5
2013-01-02  1.029785  0.762562 -2.789858  5
2013-01-03 -0.050886  0.471139  2.065092  5
2013-01-04 -1.004973  0.224072 -0.728199  5
2013-01-05 -2.045520  0.284251  0.675340  5
2013-01-06 -0.680768 -1.006230 -0.580834  5

In [44]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -1.570514 -5
2013-01-02 -1.029785 -0.762562 -2.789858 -5
2013-01-03 -0.050886 -0.471139 -2.065092 -5
2013-01-04 -1.004973 -0.224072 -0.728199 -5
2013-01-05 -2.045520 -0.284251 -0.675340 -5
2013-01-06 -0.680768 -1.006230 -0.580834 -5

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -1.570514  5  1.0
2013-01-02  1.029785  0.762562 -2.789858  5  1.0
2013-01-03 -0.050886  0.471139  2.065092  5  NaN
2013-01-04 -1.004973  0.224072 -0.728199  5  NaN

In [47]:
df1.dropna(how='any') ## NaN

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -1.570514  5  1.0
2013-01-02  1.029785  0.762562 -2.789858  5  1.0

In [48]:
df1.fillna(value=5) # NaN 5.0

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -1.570514  5  1.0
2013-01-02  1.029785  0.762562 -2.789858  5  1.0
2013-01-03 -0.050886  0.471139  2.065092  5  5.0
2013-01-04 -1.004973  0.224072 -0.728199  5  5.0

In [49]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [50]:
df.mean()

A   -0.458727
B    0.122632
C   -0.488162
D    5.000000
dtype: float64

In [51]:
df.mean(1) # axis

2013-01-01    0.857371
2013-01-02    1.000622
2013-01-03    1.871336
2013-01-04    0.872725
2013-01-05    0.978518
2013-01-06    0.683042
Freq: D, dtype: float64

In [53]:
s = pd.Series([1,3,5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [54]:
df.sub(s, axis='index')

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -1.050886 -0.528861  1.065092  4.0
2013-01-04 -4.004973 -2.775928 -3.728199  2.0
2013-01-05 -7.045520 -4.715749 -4.324660  0.0
2013-01-06       NaN       NaN       NaN  NaN

### Appply